[
  {
    "id": "intro",
    "subtitle": "Who am I?",
    "content": "I'm a&nbsp;<b>Software Development Engineer III</b>, currently acting in <b>Scrum Master</b> role, born in 1982 operating in <b>Košice, Slovakia</b>, with two decades of experience in professional IT business balancing between low-level programming and full-stack JavaScript development, now transitioning into people management."
  },
  {
    "id": "current_me",
    "image": "/current_me.jpg"
  },
  {
    "id": "history",
    "subtitle": "History",
    "content": "My humble beginnings date back to the 1980s when I&nbsp;was a&nbsp;boy who started to learn <b>BASIC</b> on a&nbsp;micro-computer <b>PMD&nbsp;85</b> produced in Czechoslovakia. After the Velvet Revolution, my elder brother bought the amazing <b>ZX-Spectrum+</b> and my interest in computers grew even stronger. Therefore, during the final years of my elementary school, I&nbsp;also learned the <b>assembly language</b> of the Zilog Z80 processor and I&nbsp;started to experiment with it. Later on, while I&nbsp;was studying electrical engineering at a&nbsp;Secondary Vocational School, I&nbsp;started to learn the <b>C&nbsp;programming language</b>. I&nbsp;guess that all these steps predestined my career."
  },
  {
    "id": "young_me",
    "image": "/young_me.jpg",
    "description": "This is me in the early '00s doing some stuff in C,<br>looking as if I had been inturrupted by someone. 😁"
  },
  {
    "id": "career",
    "subtitle": "Career",
    "content": "My first steps in professional IT were a&nbsp;little bit tough. I&nbsp;have never been really interested in school and although I&nbsp;have made a&nbsp;few attempts to earn a&nbsp;university degree, I&nbsp;dropped out after a&nbsp;year or two because I&nbsp;did not feel that traditional university education was helping me develop my career. In order to understand this fact, it is necessary to mention that in the early '00s, I&nbsp;was living in an Eastern European country where obtaining a&nbsp;university degree was an indispensable prerequisite for getting an IT job. Subsequently, I&nbsp;started to work as a&nbsp;micro-electrician and later on, I&nbsp;got the opportunity to work for a&nbsp;design studio as a&nbsp;DTP graphic designer where I&nbsp;set up a&nbsp;web development department from scratch. This event turned out to be the spark that ignited my career and opened many doors for me. I&nbsp;changed several jobs, and every change was motivated by my effort to innovate workflows or technologies that I&nbsp;was using as well as by my desire to always learn something new in order to broaden my horizons."
  },
  {
    "id": "presenting_me",
    "image": "/presenting_me.jpg",
    "description": "A snapshot from my presentation at the Ness Idea Contest 2017.<br>Eventually, I won the honorable mention prize. 😊"
  },
  {
    "id": "management",
    "subtitle": "People Management",
    "content": "In certain moment when the team grew too fast and got into performance and organisation issues, came the need for a <b>Scrum Master</b> role. I&nbsp;initiated and led meetings leading to the formation and reorganisation of the team into smaller development groups, chose members based on 1on1 conversations with them and long-term observation of their relationships and cooperation with each other, still keeping a balanced seniority. Then I defined 2-week Sprint schedule and wrote down all processes, rules and Agile ceremonies agenda to bring whole team on the same page. I'm <b>supporting the team</b> (by removing blockers, managing deps, board checking and updating), <b>supporting Product Manager</b> (by prioritisation and backlog management, shaping visions and product goals, helping to interact with developers and stakeholders) and <b>protecting the team</b> by acting as buffer for disruptive product managers and facing of objections from stakeholders. As part of this role, I also did <b>regular reporting</b> to onsite management and stakeholders of the team performance by Sprint velocity tracking, monitoring of control charts and cumulative flow charts. I&nbsp;also did <b>Agile coaching</b> of team members and helped them to improve their processes, soft skills and knowledge."
  },
  {
    "id": "hobbies",
    "subtitle": "Hobbies",
    "content": "When I'm not working, I&nbsp;like to devote my time to computer-related activities. I'm interested in old computers and I&nbsp;do a&nbsp;lot in order to keep those gems alive and spread knowledge about them. Besides my beloved daughter who has been keeping me occupied for several years now, my biggest passion is <b>production of electronic music</b>. It's amazing to create an opus just with the help of your computer, full of real or synthetic instruments, regardless of whether you can play them or not."
  }
]
